Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །རྒྱ་མཚོ་ཆེན་པོ་སོ་སོར་འཇིགས་བྱེད་པ། །གཏིང་མི་དཔོགས་པར་རབ་ཏུ་བྱིང་བ་དག །ཕ་རོལ་རྒལ་ཕྱིར་ལམ་གྱི་ཟམ་སྟེགས་བཅའ།
en: Into the immeasurable depths of the great ocean of suffering,

source: །ཟླ་བ་དྲི་མེད་ཉ་བའི་བཞིན་རས་ཅན།
en: To the further shore.’

source: །མ་ཞུམ་ཁ་ནས་དེ་སྐད་ཚིག་སྨྲས་ནས།
en: “Having spoken such words without hesitation,

source: །མཆི་མ་རླན་ཆུས་མིག་ནི་གང་གྱུར་པའི།
en: He whose face was like the spotless full moon

source: །བྱིས་པ་གཉིས་པོ་བྲམ་ཟེ་དེ་ལ་བྱིན།
en: Gave the two young children, Whose eyes were filled with tears, to the brahmin.

source: །ཡང་སྨྲས་པ།
en: “He said further:

source: བུ་འདི་བྱིན་པའི་འབྲས་བུ་ནི། །རྒྱ་ཆེན་བདག་གིས་ཐོབ་གྱུར་ནས།
en: “ ‘After I have attained the great fruit Of this giving of the children,

source: །དེས་ནི་འཁོར་བའི་རྒྱ་མཚོ་ལས།
en: Thereby beings in the world

source: །འཇིག་རྟེན་རྣམས་ནི་བསྒྲལ་བར་བྱ།
en: Should be able to cross the ocean of saṃsāra.’

source: །བུས་པ་གཞོན་ནུ་དག་བྱིན་མ་ཐག་ཏུ་ས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: “As soon as he gave the young children, the earth quaked in six ways.

source: །དེ་ནས་ས་གཡོས་པ་དེས་ཚལ་དེ་ན་གནས་པའི་དཀའ་ཐུབ་ཅན་རྣམས་སྔངས་ནས་ཕན་ཚུན་སྨྲས་པ།
en: The ascetics living in the forest were surprised at the quaking of the earth and asked each other: “ ‘By whose power

source: ས་ནི་མི་བཟད་གཡོས་གྱུར་པ། །འདི་ནི་སུ་ཡི་མཐུ་ལྟས་ཡིན། །གང་གི་མཐུ་ནི་འདི་འདྲ་བ། །ཤིན་ཏུ་གསལ་བར་ཤེས་པར་བྱ།
en: Did this dreadful quaking of the earth occur? We must clearly come to know What has such power.’

source: །དེ་ན་གནས་འཇོག་དང་རུས་གཅིག་པ་རྒན་པོ་དཀའ་ཐུབ་ཅན་ལྟས་ཤེས་པ་ལ་མཁས་པ་གཞན་ཞིག་ཡོད་པ་དེས་དྲང་སྲོང་དེ་རྣམས་ལ་དོན་དེ་གོ་བར་བྱས་པ།
en: “There was an old ascetic there from the Vasiṣṭha family who was learned in omens. He informed the ṛṣis about this matter:

source: གདོན་མི་ཟ་བར་དཀའ་ཐུབ་ཀྱི་ནགས་ན་འདུག་པའི་བུ་བྱིས་པ་འབྲས་བུ་དང་ཆུ་འཐུང་བ་ཡིད་དུ་འོང་བ། མིག་ཏུ་སྡུག་པར་བྱེད་པ་གཉིས་ཐམས་ཅད་སྒྲོལ་གྱིས་སྐྱེ་བོ་སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་སྤངས་ཏེ།
en: ‘Certainly, Viśvantara has relinquished his two children who lived in the forest of ascetics, the little ones who ate fruits and drank water, who were pleasant and agreeable to the eyes, in order to save beings overwhelmed by suffering.

source: དེས་ནས་གཡོས་པར་གྱུར་ཏོ།
en: For this reason, the earth quaked.’

source: །དེ་ནས་བུས་པ་གཞོན་ནུ་དེ་གཉིས་ཀྱིས་ཕས་སྙིང་ནས་ཡོངས་སུ་བཏང་བའི་བློ་རིག་ནས་སྙིང་རྗེ་རྗེ་སྐད་དུ་ངུ་ཞིང་ཐལ་མོ་གཉིས་སྦྱར་ནས་ཐམས་ཅད་སྒྲོལ་གྱི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ།
en: “Then the two children knew that their father intended from his heart to give them away, and, crying piteously, they made the gesture of supplication, threw themselves at Viśvantara’s feet, and said:

source: ཡབ་ཅིག་ཡུམ་ནི་མ་མཆིས་པར། །ཁྱོད་ནི་བདག་ཅག་སྩོལ་བཞེད་པ།
en: “ ‘Father, you are giving us away While mother is absent.

source: །རེ་ཞིག་དེ་ནི་མཐོང་གྱུར་ནས།
en: Please, let us see her first;

source: །དེ་ནས་བདག་ཅག་སྩལ་དུ་གསོལ།
en: Then you may give us away.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་གཅགས་པའི་སྡུག་བསྔལ་གྱིས་ངོ་ཟུམ་གནག་ཅིང་མཆི་མ་འཛག་བཞིན་དེ་གཉིས་ལ་འཁྱུད་ནས་སྨྲས་པ།
en: “Contorting his face with the pain that seized his heart and shedding tears, the bodhisattva embraced the two children and said, ‘Children,

source: བུ་དག །ང་ཡི་སྙིང་དུ་མི་སྡུག་མིན།
en: “ ‘It is not that you are not loved in my heart

source: །སྙིང་བརྩེ་སྙིང་རྗེ་མེད་མིན་ཏེ།
en: Or that I have no compassion or mercy.

source: །འཇིག་རྟེན་ཀུན་ལ་ཕན་པའི་ཕྱིར།
en: I give you to benefit the whole world,

source: །ཡོན་ཏན་མཐོང་ནས་བཏང་བ་ཡིན།
en: Having seen the good qualities of this act.

source: །ཅི་ནས་ང་ཡིས་བྱང་ཆུབ་མཆོག །ཞི་བ་རང་གིས་ཐོབ་ནས་ནི།
en: “ ‘By all means, after I myself attain Peaceful supreme awakening, I will liberate the shelterless beings in the world

source: །སྡུག་བསྔལ་རྒྱ་མཚོ་ལ་གནས་པའི། །རྟེན་མེད་འཇིག་རྟེན་རྣམས་བསྒྲལ་ལོ།
en: Who dwell in the ocean of suffering.’

source: །དེ་ནས་བུས་པ་གཞོན་ནུ་དེ་དག་གིས་ཕས་སྙིང་ནས་ཡོངས་སུ་བཏང་བའི་བློ་རིག་ནས་ཕའི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ་ཐལ་མོ་སྦྱར་ནས་སྙིང་རྗེ་རྗེ་སྐད་དང་། སྨ་བབ་པའི་ཚིག་གིས་དལ་གྱིས་སྨྲས་པ།
en: “Then, knowing that their father intended from his heart to give them away, the children paid homage at their father’s feet, made the gesture of supplication, and slowly said in piteous voices with humble words: “ ‘If you have decided,

source: གལ་ཏེ་ཁྱོད་ཀྱིས་ཐག་བཀུམ་ན།
en: Father, may you give a message

source: །མ་ལ་བདག་ཅག་གཉིས་ཀྱི་ཕྲིན། །ཁྱོད་ཀྱིས་བཟོད་པ་མཛོད་ཅིག་ཅེས། །ཡབ་ཅིག་ཁྱོད་ཀྱིས་གསུང་དུ་གསོལ།
en: From the two of us to our mother: “May you bear it.”

source: །ཡབ་གཞན་ཡང་།
en: “ ‘Again, Father,

source: བྱིས་པར་གྱུར་པས་བླ་མ་ཁྱོད་ལ་ནོངས་པ་བགྱིས་པ་གང་།
en: “ ‘For the faults we have committed out of childishness against you who are respectable,

source: །གལ་ཏེ་ལ་ལར་ཐུགས་ལ་མི་འབབ་ཚིག་འགའ་སྨྲས་པའམ།
en: The unpleasant words we have spoken to anyone, if any,

source: །གུས་པར་མཉན་ནས་ཡོངས་སུ་མཉེས་པ་ཉིད་དུ་མ་བགྱིས་པ།
en: And that we did not listen to you respectfully or please you—

source: །དེ་ནི་བྱིས་པའི་ནོངས་པ་ལགས་ཞེས་བཟོད་པ་མཛད་དུ་གསོལ།
en: Please forgive us, taking them as childish faults.’

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་ཕ་ལ་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་མིག་མཆི་མས་གང་བཞིན་དུ་བླ་མ་ལ་སྨྲ་བར་ཡིད་ལ་ཆགས་པས་ཡང་དང་ཡང་ཕྱིར་ལྟ་ཞིང་བསྟི་གནས་དེ་ནས་བྱུང་སྟེ་སོང་ངོ་།
en: “After they had thus spoken, they saluted their father, circumambulated him three times, and left the hermitage with tearful eyes, still desiring to speak to the respectable one, looking back again and again.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱིས་པ་གཞོན་ནུའི་ཚིག་ཤིན་ཏུ་སྙིང་རྗེར་རུང་བ་དེ་དག་གིས་སྙིང་བློང་ནས་ཡིད་ཀྱིས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ་དཀའ་ཐུབ་ཀྱི་ཚལ་གྱི་ལོ་མའི་སྤྱིལ་བུར་ཞུགས་སོ།
en: “Then, losing his composure because of his young children’s very piteous words, the bodhisattva made a vow for awakening in his mind and entered the hut in the forest of ascetics.

source: །བྱིས་པ་གཞོན་ནུ་དག་དོང་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: As soon as the young children left, the worlds of the great billionfold universe quaked in six ways.

source: །ལྷ་སྟོང་ཕྲག་དུ་མ་ཡང་བར་སྣང་ལ་ཅ་ཅོ་དང་། ག་ཞའི་སྒྲ་འབྱིན་ཅིང་།
en: Thousands of gods emitted cries and laughter in the air, and said: “ ‘Bravo!

source: ཨེ་མའོ་རབ་སྦྱིན་བདག་ཉིད་ཆེ།
en: Great nature of generosity!

source: །བུས་པ་འདི་གཉིས་བཏང་ནས་ཀྱང་།
en: Excellent is the steadfastness of the one

source: །གང་གི་ཡིད་ནི་འགྱུར་མེད་པ།
en: Who does not change his mind,

source: །དེ་ཡི་ངེས་པ་རྨད་ཅིག་གོ།
en: Even having given his two children.’

source: །དེ་ནས་རྒྱགས་སྦྱིན་མ་རྩ་བ་དང་འབྲས་བུ་རྣམས་ཁྱེར་ཏེ་བསྟི་གནས་ལོགས་སུ་ཆས་པ་ལས་ས་ཆེ་ཐང་དུ་གཡོས་པ་དེས་མྱུར་བ་ཁོ་ནར་བསྟི་གནས་དེ་ཉིད་དུ་སོང་བ་དང་། ལྷ་གཞན་ཞིག་གིས་རྒྱགས་སྦྱིན་མ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཐར་བར་བྱ་བར་བརྩོན་པ་བྱས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ཆད་བྱེད་པར་འགྱུར་དུ་འོང་ངོ་སྙམ་ནས་སེང་གེ་མོ་ཞིག་གི་གཟུགས་སུ་བསྒྱུར་ཏེ་ལམ་བཀག་ནས་འདུག་པ་དང་། རྒྱགས་སྦྱིན་མས་རི་དགས་ཀྱི་རྒྱལ་པོའི་ཆུང་མ་དེ་ལ་སྨྲས་པ།
en: “At that time Mādrī was coming back to the hermitage, bringing roots and fruits. She hurried to the hermitage because of the quaking of the earth. A deity thought, ‘Mādrī is coming to deter the bodhisattva from the perfection of giving in which he has made efforts to liberate all beings,’ and so the deity assumed the form of a lioness and stood blocking the way. Mādrī said to the wife of the king of beasts:

source: རི་དགས་རྒྱལ་པོའི་ཆུང་མ་སྒེག་སྒེག་མ།
en: “ ‘Attractive wife of the king of beasts,

source: ཁོ་མོའི་འདི་བཀག་ནས་ནི་ཅི་སྟེ་འདུག །
en: Why are you blocking the way?

source: ཇི་ལྟར་བདག་ནི་མི་འཕྱོ་ངེས་ཤེ་ན།
en: As I am of unshaken constancy,

source: །ལམ་ལས་བཟུར་སྟེ་མྱུར་དུ་འགྲོ་བར་གྱིས། གཞན་ཡང་།
en: Get out of the way and go quickly! “ ‘Again,

source: ཁྱོད་ཀྱང་རི་དགས་རྒྱལ་པོའི་ཆུང་མ་ལ།
en: “ ‘You are the wife of the king of beasts;

source: །བདག་ཀྱང་མི་ཡི་དབང་པོ་སེང་གེ་ཡི།
en: I too am the consort of the people’s master, Who is like a lion.

source: །བཙུན་མོ་ཡིན་པས་ཆོས་ཀྱི་སྤུན་གྱུར་གྱིས།
en: Hence, you are my sister, according to the Dharma.

source: །རི་དགས་རྒྱལ་མོས་བདག་གི་ལམ་ཕྱེ་ཤིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷ་སེང་གེའི་གཟུགས་སུ་བསྒྱུར་བ་དེ་ཡང་ལམ་དེ་ནས་ལོགས་ཤིག་ཏུ་སོང་ངོ་།
en: So, queen of beasts, make way for me.’ “Having been spoken to in this way, the deity assuming the form of a lioness left the road in a certain direction.

source: །དེ་ནས་རྒྱགས་སྦྱིན་མས་བཀྲ་མི་ཤིས་པའི་ལྟས་དག་མཐོང་ནས་ཡུད་ཙམ་ཞིག་བསམས་པ།
en: Thereupon, seeing inauspicious signs, Mādrī paused to think:

source: ཇི་ལྟར་བར་སྣང་ལ་ངུད་མོའི་སྒྲ་གྲག་པ་དང་། ཇི་ལྟར་ཡང་ཚལ་ན་གནས་པའི་ལྷ་རྣམས་མྱ་ངན་བྱེད་པའི་སྒྲ་གྲག་པ་ལས་ན་གདོན་མི་ཟ་བར་བསྟི་གནས་སུ་མ་ལེགས་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ་སྙམ་ནས་སྨྲས་པ།
en: ‘As I hear voices sobbing in the air, and the lamenting voices of the gods living in the forest, too, something unfortunate has certainly happened in the hermitage.’ She then said aloud:

source: ཇི་ལྟར་བདག་མིག་འགུལ་བ་དང་། །ཇི་ལྟར་བྱ་སྐད་འབྱིན་པ་དང་། །ཇི་ལྟར་བདག་ནི་དོགས་པ་ལས།
en: “ ‘As my eyes are blinking, As birds are crying, As I feel anxious,

source: །བུས་པ་དེ་གཉིས་བཏང་བར་ངེས།
en: The two children must have been given away.

source: །ཇི་ལྟར་ས་འདི་གཡོས་པ་ལས།
en: “ ‘As the land quakes,

source: །བདག་གི་སྙིང་ནི་འདར་བ་དང་། །ཇི་ལྟར་ལུས་ཀྱང་རྨྱ་བ་ལས།
en: And my heart quivers, And as my body feels ill,

source: །ཞེས་དེ་ལྟ་བུའི་མི་ལེགས་པ་བརྒྱ་སྟོང་དག་སེམས་ཤིང་བསྟི་གནས་སུ་སོང་ནས་བསྟི་གནས་སུ་ཞུགས་ཏེ་མི་དགའ་བཞིན་བལྟས་ན་བུ་གཉིས་མ་མཐོང་ནས།
en: “Thinking of a hundred thousand such unfortunate things, she hurried to the hermitage. When she entered the hermitage, upset, she searched for the two children but did not see them.

source: དེ་ནས་རྨོངས་ཤིང་སྙིང་འདར་ནས་བསྟི་གནས་ཀྱི་གཞི་དེའི་རྗེས་བཞིན་དུ་སེམས་ཏེ། ཕྱོགས་འདི་ན་ནི་གཞོན་ནུ་ནག་པོ་སྲིང་མོ་དང་ལྷན་ཅིག་རི་དགས་ཀྱི་ཕྲུ་གུ་དང་རྟག་ཏུ་རྩེ་རྩེ།
en: Perplexed, with her mind quivering, she thought at each place in the hermitage, ‘In this place, my son Kṛṣṇa with his sister always played with fawns.

source: འདི་ནི་དེ་གཉིས་ཀྱི་ས་རྡུལ་ལས་བྱས་པའི་ཁྱིམ་ཡིན།
en: These are the houses the two of them made from dust.

source: འདི་ནི་དེ་གཉིས་ཀྱི་རྩེད་མོའི་ཆ་སྤྱད་ཡིན་ན་དེ་གཉིས་མི་སྣང་ན།
en: These are the toys of those two. But I do not see them.

source: གལ་ཏེ་ཞིག་ན་བདག་གིས་མ་མཐོང་གི །ལོ་མའི་སྤྱིལ་བུར་ཞུགས་ནས་ཉལ་ལྟ་སྲིད་དམ་སྙམ་དུ་དེ་ལྟར་སྙིང་ལ་རེ་ཞིང་། བུ་མཐོང་བར་འདོད་པས་རྩ་བ་དང་འབྲས་བུ་ཕྱོགས་གཅིག་ཏུ་བཞག་ནས་མིག་མཆི་མས་གང་བཞིན་དུ་ཁྱིམ་ཐབ་ཀྱི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ། རྗེའི་སྲས་ཁྱེའུ་དང་བུ་མོ་གཉིས་གང་དུ་མཆིས།
en: Perhaps they have entered a grass hut that I do not see and are sleeping.’ Thus worrying and desiring to see her children, she put the roots and fruits to one side, threw herself at her husband’s feet, and cried out with tearful eyes, ‘My dear, where are the two, our son and daughter?’

source: ཐམས་ཅད་སྒྲོལ་གྱིས་སྨྲས་པ།
en: “Viśvantara said to her:

source: ཁོ་བོའི་དྲུང་དུ་བྲམ་ཟེ་ཞིག །རེ་བས་ཡང་དག་འོངས་གྱུར་ནས།
en: “ ‘A brahmin with a wish Came to me,

source: །བུས་པ་དེ་གཉིས་དེ་ལ་བྱིན།
en: And I gave those two children to him.

source: །དེ་དག་རྗེས་སུ་ཡི་རང་རིགས།
en: It would be appropriate for you to be pleased with this.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། རྒྱགས་སྦྱིན་མ་རི་དགས་མོ་མདའ་དུག་ཅན་གྱིས་ཕོག་པ་བཞིན་དུ་ས་ལ་སྒྱེལ་ནས་ཉ་ཆུའི་གནས་ནས་ཕྱུང་བ་བཞིན་དུ་ནི་འགྲེ་ལྡོག་པར་བྱེད། ཀྲུང་ཀྲུང་བུ་སྟོར་བ་བཞིན་དུ་ནི་སྙིང་རྗེ་རྗེ་སྐད་དུ་ངུ་། བ་བེའུ་ཤི་བ་བཞིན་དུ་ནི་འབའ་སྒྲ་སྣ་ཚོགས་འདོན་ཅིང་སྨྲས་པ། པད་མ་གཞོན་ནུ་ལྟ་བུའི་བྱད་བཞིན་ཅན།
en: “When she was told this, Mādrī fell to the ground like a doe shot with a poisoned arrow, writhed like a fish out of water, cried in a piteous voice like a crane that had lost its chicks, lowed in various ways like a cow whose calves have died, and said:

source: །ལག་པ་པད་མའི་འདབ་ལྟར་གཞོན་ཤ་ཅན།
en: “ ‘With faces like young lotus blossoms, With hands as fresh as lotus petals,

source: །བདག་གི་བུ་གཉིས་སྡུག་བསྔལ་མ་མྱོང་བ།
en: My two children had never experienced any pain.

source: །འགྲོ་བ་གང་དུ་སོང་ནས་སྡུག་བསྔལ་འགྱུར།
en: In which direction do they go, just to suffer?

source: །རི་དགས་བུ་ལྟར་དྲང་ཞིང་རི་དགས་མིག །རི་དགས་ལྷན་ཅིག་བསྟི་གནས་དགའ་དགའ་ན།
en: “ ‘Being as meek as fawns, with eyes like a fawn’s, Having enjoyed the hermitage together with fawns—

source: །དེ་རིང་བདག་གི་བུ་གཉིས་ཇི་ལྟ་བུར། །གཞན་གྱི་དབང་གིས་དོང་ཞིང་སྡུག་བསྔལ་གྱུར།
en: How did my two children suffer today, Dragged away by another?

source: །མིག་ནི་མཆི་མས་གང་བའི་མིག་གིས་ནི།
en: “ ‘With their eyes full of tears,

source: །སྙིང་རྗེས་ངུ་བ་ཤིན་ཏུ་སྡུག་བསྔལ་བ།
en: Crying in sorrow, greatly suffering, They will live miserably among poor people

source: །དེ་རིང་བདག་གིས་ལེགས་པར་མ་མཐོང་བས། །སྐྱེ་བོ་བཀྲེན་པའི་ནང་ན་སྡུག་པས་འཚོ།
en: Because I was not carefully watching them today.

source: །དེ་གཉིས་བདག་གིས་པང་ནས་བསྐྱེད་བསྐྱེད་པ།
en: “ ‘Those two I raised on my lap

source: །ཟས་སུ་རྩ་བ་མེ་ཏོག་འབྲས་བུ་ཟ། །བཟོད་དང་གནམ་པས་བླ་མ་བརྟག་དཀའ་བ།
en: Ate roots, flowers, and fruits as meals.

source: །བདག་གི་བུ་གཉིས་ཤིན་ཏུ་སྡུག་བསྔལ་ལོ།
en: My two children, who lived with patience and loved those who are respectable, Are suffering greatly.

source: །དེ་གཉིས་མ་དང་ཉེ་དུ་བྲལ་བ་དང་། །རྩ་ལག་རྣམས་ཀྱིས་གཟུ་ལུམས་སྤངས་པ་ལས།
en: “ ‘The two have been parted from their mother and kinsmen, And have been suddenly abandoned by their relatives.

source: །སྐྱེ་བོ་སྡིག་ཅན་ངན་དང་ཕྲད་གྱུར་ནས།
en: Having met an evil, sinful person,

source: །སྐོམ་ཞིང་བཀྲེས་པས་བདག་ཉིད་རྟག་གདུངས་ནས།
en: “ ‘Pressed by constant hunger and thirst,

source: །དེ་གཉིས་སུ་ཡི་དབང་གིས་འགྲོ་བར་འགྱུར།
en: By whom were the two taken away?

source: །བྲན་དུ་གྱུར་པས་གདོན་མི་ཟ་བར་ནི།
en: Having become slaves, certainly

source: །དེ་གཉིས་ཉམ་ཐག་སྡུག་བསྔལ་ཡོངས་སུ་གཟིར།
en: The two will suffer from dreadful pain.

source: །བདག་གིས་ངེས་པར་ཚེ་རབས་གཞན་དག་ཏུ། །སྲོག་ཆགས་སྡུག་པ་བརྒྱ་དང་བྲལ་བ་ཡི།
en: “ ‘Surely, I must have in other lives

source: །སྡིག་ལས་ཤིན་ཏུ་མི་བཟད་འདིར་བྱས་པ།
en: Committed a dreadful, evil act in this world And parted beings from a hundred loved ones

source: །དེས་ན་བ་བེའུ་མེད་བཞིན་ཆོ་ངེས་འདེབས།
en: Whereby I am now crushed by grief like a cow without its calves.

source: །བདེན་ཚིག་གང་གིས་བདག་ནི་རྟག་ཏུ་ཡང་།
en: “ ‘The true words by which I have always conceived

source: །སེམས་ཅན་ཀུན་ལ་ཡིད་ནི་མཉམ་གྱུར་པ།
en: Impartial thoughts for every living being—

source: །བདེན་ཚིག་དེས་ནི་བདག་གི་བུ་གཉིས་པོ།
en: By these true words

source: །བྲན་དུ་གྱུར་པ་ལས་ནི་ཐར་བར་ཤོག །རྒྱགས་སྦྱིན་མས་བུས་པ་གཞོན་ནུ་དེ་དག་གིས་བསྐྱེད་ཅིང་བསྲུངས་པའི་ཤིང་གང་ཡིན་པ་དེ་དག་ལོ་མ་ཐིབ་བེ་འདུག་པར་མཐོང་ནས་སྙིང་དུ་སྡུག་ནས་འཁྱུད་དེ་སྨྲས་པ།
en: May my two children be liberated from servitude.’ “Mādrī saw trees that those young children had planted and grown, which had abundant leaves, and in her anguish embraced them, and said:

source: བུས་པས་རིལ་བ་ཆུང་ངུས་ཆུ་བཅུས་པ།
en: “ ‘The trees on which the children poured water with a little water jar,

source: །ལོ་མ་རྣམས་ལས་ཆུ་ཐིགས་འཛག་པ་ཡི།
en: From whose leaves water is dripping,

source: །ལྗོན་ཤིང་རྣམས་ནི་སེམས་དང་བཅས་པ་བཞིན།
en: Look as if they have hearts,

source: །བུས་པ་ནུ་ཞོ་མ་བླུད་ལྟ་བུར་ངུ་།
en: Like a mother giving milk to her children.’

source: །ཡང་བུས་པ་གཞོན་ནུ་དེ་གཉིས་དང་རྩེ་རྩེ་བའི་རི་དགས་ཀྱི་ཕྲུ་གུ་བསྟི་གནས་ན་འདུག་པ་རྣམས་མཐོང་ནས་མི་དགའ་སྟེ་སྙིང་རྗེ་རྗེ་སྐད་ཀྱི་ཚིག་གིས་དལ་བུས་སྨྲས་པ། དེ་ཡི་ནེའུ་ཟླ་མཐོང་བར་འདོད་པ་གང་། །ནགས་སུ་ས་ཚུགས་མཚོན་ཅིང་ཚོལ་བྱེད་པ།
en: “Then she saw the fawns that had played with the two young children sitting in the hermitage and became pained. She slowly said in a piteous voice: “ ‘These fawns who are their friends, Who want to see them

source: །རི་དགས་ཕྲུ་གུ་རྒྱུ་བ་འདི་དག་ཀྱང་།
en: And walk around looking for them in the house,

source: །བདག་གི་སྡུག་བསྔལ་མི་ཆུང་གཞན་ཡིན་ནོ།
en: Are another source of extreme pain for me.’

source: །དེ་ནས་བུས་པ་གཞོན་ནུ་དེ་དག་ལམ་གང་ནས་དོང་བའི་ལམ་དེར་རྗེས་བཅད་པ་དང་། བུས་པ་གཞོན་ནུ་དེ་གཉིས་ཀྱི་རྗེས་དྲང་པོར་མ་བྱུང་གི་གྱ་གྱུས་གང་བར་མཐོང་ནས་ལྷག་པར་ཡང་སྡུག་བསྔལ་གྱིས་གདུངས་ནས་སྨྲས་པ།
en: “Then, when she followed the way along which those children had gone, she saw that the two young children’s footprints were not straight but twisted and turned here and there. Pressed by acute pain again, she said: “ ‘Since there remain footsteps of shuffled feet,

source: ཇི་ལྟར་འཐེན་པའི་རྗེས་བྱུང་དང་། །ལ་ལར་མྱུར་དུ་སོང་བ་ལས།
en: And they proceed in a hurry here and there,

source: །བརྡེགས་ཏེ་ཁྲིད་པར་གདོན་མི་ཟ།
en: Certainly, he must have hit them while he took them along. Shame!

source: །ཀྱེ་མ་བྲམ་ཟེ་བརྩེ་མེད་མཆོག །མགུལ་ནི་དབུགས་ཀྱིས་བརྫངས་ཤིང་སྐད་ཀྱང་འཛེར།
en: So pitiless a brahmin! “ ‘With their throats gasping, giving out cries,

source: །མ་མཆུ་མཛེས་པ་འདར་ཞིང་བདག་གི་བུ།
en: With their lovely lips quivering,

source: །རི་དགས་བཞིན་དུ་མིག་ཀྱང་རིག་རིག་སྟེ།
en: With watery eyes like a deer and tender feet,

source: །རྐང་པ་འཇམ་པོས་ཇི་ལྟར་སོང་ཞིག་གུ།
en: How did my children go?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དེ་དེ་ལྟར་སྨྲེ་སྔགས་འདོན་པའི་བདག་ཉིད་དེ་མཐོང་ནས་མི་རྟག་པ་ཉིད་དང་ལྡན་པའི་ཚིག་དེ་དང་དེ་དག་གིས་རྣམ་གྲངས་མང་པོར་གོ་བར་བྱས་ནས་སྨྲས་པ།
en: “Upon seeing her thus pouring out lamentations, the bodhisattva reasoned with her with words concerning impermanence in a variety of ways and said:

source: ཁོ་བོས་བུ་གཉིས་གྲགས་པ་ཡིས།
en: “ ‘I did not give the two children for the sake of fame

source: །བཏང་བ་མ་ཡིན་སྡང་བས་མིན།
en: Nor out of hatred.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་དོན་དུ།
en: For the benefit of all beings,

source: །གཏང་བར་དཀའ་བའི་བུ་དེ་བཏང་།
en: I gave the children who were difficult to give.

source: །མཆོག་ཏུ་གཏང་དཀའ་བདག་ཉིད་དང་། །བུ་ནོར་ཆུང་མ་རྣམས་བཏང་ནས།
en: “ ‘Having given himself, his own children, and his wife, Who are the most difficult to give,

source: །སེམས་དཔའ་ཆེན་པོས་ཚུལ་བཞིན་དུ།
en: The mahāsattva will properly attain

source: །བྱང་ཆུབ་མཆོག་ནི་ཐོབ་པར་འགྱུར།
en: Supreme awakening. “ ‘Mādrī, relying upon giving, I gave those two children

source: །རྒྱགས་སྦྱིན་བདག་གིས་གཏོང་བ་ལ་བརྟེན་གཏང་དཀའ་བའི། །བུས་པ་དེ་གཉིས་འཇིག་རྟེན་ཐར་པའི་དོན་དུ་བཏང་།
en: Who were difficult to give in order to liberate the world.

source: །བདག་དང་ཆུང་མ་བཞོན་དང་ནོར་ཡང་བཏང་བྱས་ཏེ།
en: I have a resolve to give myself and my wife, vehicle, and wealth,

source: །ཀུན་ལ་ཐམས་ཅད་གཏང་བའི་བློ་གྲོས་ང་ལ་ཡོད།
en: And give everything to everyone.’

source: །དེ་ནས་རྒྱགས་སྦྱིན་མས་སེམས་བརྟན་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Then Mādrī said to the bodhisattva, making a firm resolution:

source: ཁྱོད་ལ་བར་ཆད་མི་བགྱིད་ཀྱིས།
en: “ ‘I will not thwart you.

source: །ཁྱོད་བློ་གཞན་དུ་མ་གྱུར་ཅིག །གལ་ཏེ་བདག་ཀྱང་སྩོལ་བཞེད་ན།
en: May your mind never become otherwise. If you are asked to give me, too,

source: །དོགས་པ་མེད་པར་བདག་སྩོལ་ཅིག །གཞན་ཡང་།
en: Give me without hesitation. “ ‘Again,

source: དཔའ་བོ་གང་ཕྱིར་ཉིད་ཀྱི་ཕྱིར།
en: “ ‘O hero, having soon accomplished the purpose For which you gave your family,

source: །སྡུག་པས་ཆགས་པ་བཏང་བ་ཡི། །དོན་དེ་མྱུར་དུ་ཐོབ་ནས་ནི།
en: Who are attached to their beloved,

source: །སྲིད་ལས་འགྲོ་བ་བསྒྲལ་བར་མཛོད།
en: Liberate beings from existence.’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་དང་། རྒྱགས་སྦྱིན་མ་བརྩོན་འགྲུས་ཤིན་ཏུ་རྨད་དུ་བྱུང་བ་དང་། ཤིན་ཏུ་བྱ་དཀའ་བར་རིག་ནས་སུམ་བཅུ་རྩ་གསུམ་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ་སྟེང་གི་ནམ་མཁའ་ལས་བསྟི་གནས་དེར་ལྷགས་ནས་སྣང་བ་རྒྱ་ཆེན་པོས་ནགས་དེ་གསལ་བར་བྱས་ཏེ། ནམ་མཁའ་ལ་འདུག་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Then Śakra, Lord of the Gods, knew that the bodhisattva and Mādrī were making efforts that were marvelous and very difficult to make. Surrounded by the Thirty-Three Gods, he approached the hermitage through the sky, illuminated the forest with a vast splendor of light, and said to the bodhisattva while hovering in the air:

source: འདི་ལྟར་འཇིག་རྟེན་རྨོངས་པ་བློ་ངན་གཞུང་གིས་བཅིངས་པའི་བློ་གྲོས་ཅན།
en: “ ‘Thus among foolish beings in the world, of weak intelligence and intellects shackled by propensities,

source: །ལོངས་སྤྱོད་ལ་ཆགས་སྙིང་གི་ཞགས་པ་བུ་ཡིས་བཅིངས་པའི་ནང་ན་ཡང་།
en: Who are attached to enjoyment and fettered by children who are a noose for the mind,

source: །ཁྱབ་བདག་ཁྱོད་གཅིག་ཆགས་པ་མེད་པས་དགའ་བ་བསྐྱེད་པའི་བུ་གཏོང་བས། །ངེས་པར་གོ་འཕང་བ་དེ་དང་ཞི་བ་དྲི་མེད་དཀའ་བ་མེད་པར་འཐོབ།
en: O Ruler, only you will attain the firm, happy, tranquil, spotless, and faultless state By giving away your children who cause you joy, being free from attachment.’

source: །དེ་སྐད་ཅེས་བྱང་ཆུབ་སེམས་དཔའ་སྤྲོ་བ་བསྐྱེད་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམ་པ། འདི་གཅིག་པུ་གཡོག་དང་བྲལ་ན་ཉོན་མོངས་པར་འགྱུར་གྱིས།
en: “Having encouraged the bodhisattva in this way, Śakra, Lord of the Gods, thought, ‘If he winds up alone, separated from the one attending him, he will become distressed.

source: མ་ལ་བདག་གིས་རྒྱགས་སྦྱིན་མ་བསླང་ངོ་སྙམ་ནས།
en: So I will now ask him for Mādrī.’

source: དེ་ནས་བྲམ་ཟེའི་ཆ་བྱད་དུ་བསྒྱུར་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་སོང་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Then he assumed the form of a brahmin, went to the bodhisattva, and said to him: “ ‘Give me this sister, of perfect body,

source: ཡན་ལག་ཀུན་བཟང་ཁྱིམ་ཐབ་ལས།
en: A devoted wife who never becomes

source: །འཕྱོ་བ་མེད་ཅིང་སྙིང་ཉེ་བ།
en: Unfaithful to her husband,

source: །རིགས་ན་བསྔགས་པའི་སྲིང་མོ་འདི། །བདག་ལ་བྲན་མོའི་དོན་དུ་སྩོལ།
en: And is praised for her family lineage, as a slave.’

source: །དེ་ནས་རྒྱགས་སྦྱིན་མ་མི་བཟོད་པ་སྐྱེས་ནས་བྲམ་ཟེ་ལ་སྨྲས་པ།
en: “Unable to bear this, Mādrī said to the brahmin:

source: ངོ་ཚ་མེད་ཅིང་བརྐམ་པ་ཁྱོད།
en: “ ‘Do you, who are shameless and greedy,

source: །འདི་ན་བྲམ་ཟེ་ཐ་ཤལ་ཏེ།
en: The worst brahmin in this world,

source: །ཁྱོད་ལྟ་འཕྱོན་མ་མི་བྱེད་ཅིང་།
en: Desire me, a faithful wife

source: །དམ་ཆོས་དགའ་བ་ང་འདོད་དམ།
en: Who rejoices in the authentic Dharma?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་སྙིང་རྗེ་དང་ལྡན་པའི་སྙིང་གིས་རྒྱགས་སྦྱིན་མ་ལ་བརྟག་པར་བརྩམས་པ་དང་། དེ་ནས་རྒྱགས་སྦྱིན་མས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “The bodhisattva Viśvantara observed Mādrī with a compassionate mind. Mādrī then said to the bodhisattva:

source: བདག་ནི་བདག་ལ་གཡར་ངན་མེད།
en: “ ‘I do not lament for myself.

source: །དེ་བཞིན་བདག་ལ་ལྟ་མ་ལགས།
en: I do not care about myself, But I lament for you, wondering

source: །གཅིག་པུ་ཇི་ལྟར་བཞུགས་འགྱུར་ཞེས། །དེ་ལྟར་ཁྱོད་སླད་གཡར་ངན་བགྱིད།
en: How you will live alone.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རྒྱགས་སྦྱིན་མ་ལ་སྨྲས་པ།
en: “The bodhisattva replied to Mādrī:

source: གོ་འཕང་མི་ཟད་མྱ་ངན་མེད་པ་ཚོལ་བདག་ལ། །ས་སྟེངས་འདིར་ནི་རྒྱགས་སྦྱིན་མྱ་ངན་བྱ་མི་དགོས།
en: “ ‘On the face of the earth, Mādrī, you should not grieve for me, Who seeks the state free from decay and grief.

source: །ཁྱོད་ནི་མྱ་ངན་མེད་པར་བྲམ་ཟེ་འདི་རྗེས་འབྲོངས།
en: You should follow this brahmin without grieving.

source: །བདག་ནི་རི་དགས་འཆི་བ་བཞིན་དུ་བསྟི་གནས་འཐེང་།
en: I will limp into the hermitage like a dying animal.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དགའ་བ་དང་། མགུ་བ་དང་། ཡིད་རབ་ཏུ་དགའ་བས་བསམས་པ་དང་། སྦྱིན་པ་འདི་ནི་ནགས་ཚལ་འདིར།
en: “After saying this, being pleased, delighted, and gladdened, he thought: “ ‘This gift is, in this forest,

source: །བདག་གི་སྦྱིན་པ་ཐ་མ་ཡིན།
en: My last donation.

source: །རྒྱགས་སྦྱིན་འདི་ཡང་ཡོངས་བཏང་ནས།
en: After having given this Mādrī,

source: །ཡོངས་སུ་གཟུང་བ་མེད་པར་འགྱུར།
en: There will be nothing that fetters me.’

source: །སྙམ་དུ་རིག་ནས་རྒྱགས་སྦྱིན་མ་ལག་པ་ནས་བཟུང་སྟེ། བྲམ་ཟེ་དེ་ལ་སྨྲས་པ།
en: “Knowing this, he held Mādrī with his hand and said to the brahmin: “ ‘O best of brahmins,

source: བདག་གི་མཆིས་འབྲང་སྡུག་པ་འདི།
en: Please accept my beloved wife,

source: །སྙིང་ནས་སྙིང་ཉེ་བསྒོ་བ་ཉན།
en: Who is heartily pleased to obey,

source: །ཡ་རབས་ཚུལ་ཅན་སྙན་པར་སྨྲ། །བྲམ་ཟེའི་མཆོག་ཁྱོད་བཞེས་སུ་གསོལ།
en: Who is noble and acts properly, and who speaks agreeably.’

source: །དེ་ནས་མཆེ་བ་བཟང་པོ་ཡི།
en: “Then he gave his wife, who had beautiful teeth,

source: །ཆུང་མ་བྱང་ཆུབ་འདོད་ཕྱིར་བཏང་།
en: In order to seek awakening.

source: །ཆུ་ལ་གྲུ་ནི་ཇི་ལྟ་བར།
en: As if it were a ship on the water,

source: །ས་ནི་མཐའ་དག་རྣམ་དྲུག་གཡོས།
en: The entire earth quaked in six ways.

source: །དེ་ནས་རྒྱགས་སྦྱིན་མ་བྲམ་ཟེའི་དབང་དུ་གྱུར་ཏེ།
en: “Thereupon Mādrī entered into the brahmin’s possession.
